blueskycoco/rt-thread/bsp/tm4c129x/applications/con_epi.c
	unsigned char *buf=RT_NULL;
	int index_len=0,i;
	char cnt=0;
	unsigned char *index_addr;
	int do_config=0;
	#if !A_TO_B
	unsigned char source=g_pui8EPISdram[A_TO_B_SIGNAL];
	rt_kprintf("_epi_read source %02x\r\n",source);
	if(source==SIGNAL_DATA_IN)
	{
		rt_kprintf("\nGOT A_TO_B Data\n");
		for(i=0;i<510;i++)
			rt_kprintf("%d ",g_pui8EPISdram[i]);
		g_pui8EPISdram[CONFIG_A_TO_B_ADDR]=0xff;
	}
	#else
	unsigned char source=g_pui8EPISdram[B_TO_A_SIGNAL];
	rt_kprintf("\n_epi_read source %02x\r\n",source);
	if(source==SIGNAL_DATA_IN)
	{	
		rt_kprintf("\nGOT B_TO_A Data\n");
		for(i=511;i<1019;i++)
			rt_kprintf("%d ",g_pui8EPISdram[i]);
		g_pui8EPISdram[CONFIG_B_TO_A_ADDR]=0xff;
	}
	#endif
	return ;
	#if 0
	switch (source)
	{
		case SIGNAL_CONFIG_SOCKET0:
		case SIGNAL_CONFIG_SOCKET1:
		case SIGNAL_CONFIG_SOCKET2:
		case SIGNAL_CONFIG_SOCKET3:
		{
			index_len=g_pui8EPISdram[SOCKET0_R_LEN_REG+source*2];
			index_addr=(unsigned char *)(g_pui8EPISdram+CONFIG_ADDR);
			do_config=1;
		}
		break;
		case SIGNAL_DATA_SOCKET0:
		case SIGNAL_DATA_SOCKET1:
		case SIGNAL_DATA_SOCKET2:
		case SIGNAL_DATA_SOCKET3:
		{
			index_len=g_pui8EPISdram[SOCKET0_R_LEN_REG+(source-0x04)*2];
			index_addr=(unsigned char *)(g_pui8EPISdram+SOCKET0_R_ADDR+(source-0x04)*SOCKET_BUF_LEN);
		}
		break;
		default:
		{
			unsigned char mask=source&0xf0;
			if(mask==SIGNAL_CONFIG_WITH_IPV6)
			{
				index_len=g_pui8EPISdram[SOCKET0_R_LEN_REG+(source&0x0f)*2];
				index_addr=(unsigned char *)(g_pui8EPISdram+SOCKET0_R_ADDR+(source&0x0f)*SOCKET_BUF_LEN);
				do_config=1;
			}
			else if(mask==ACK_SIGNAL)
			{
				rt_kprintf("0x%02x ACK Got\r\n",source);
				ack_got=1;
				return ;
			}
		}
		break;
	}
	rt_kprintf("to copy %d bytes from 0x%08x\r\n",index_len,index_addr);
	//while(buf==RT_NULL)
	{
		buf=(unsigned char *)malloc(index_len*sizeof(unsigned char));
		if(buf==RT_NULL)
			rt_kprintf("source 0x%02x is RT_NULL\r\n",source);
	}
	rt_memcpy(buf,index_addr,index_len);
	if(do_config)
	{
		if(buf[0]==0xf5 && buf[1]==0x8a)
		{		
			int check_sum=0,longlen=0;
			rt_kprintf("epi Config len %d\r\n",index_len);
			for(i=0;i<index_len-2;i++)
			{
				rt_kprintf("%02x ",buf[i]);
				check_sum+=buf[i];
			}
			rt_kprintf("\r\n");
			if(check_sum==(buf[index_len-2]<<8|buf[index_len-1]))
			{
				if(buf[2]==0x0c || buf[2]==0x0d || buf[2]==0x0e || buf[2]==0x0f || buf[2]==0x20)
					longlen=buf[3];					
				usb_config(buf+2,longlen,0);
				_epi_write(source&0x0f,(void *)COMMAND_OK, strlen(COMMAND_OK),ACK_SIGNAL|(SIGNAL_CONFIG_SOCKET0+source&0x0f));
			}
			else
				_epi_write(source&0x0f,(void *)COMMAND_FAIL, strlen(COMMAND_FAIL),ACK_SIGNAL|(SIGNAL_CONFIG_SOCKET0+source&0x0f));
		}
		else if(buf[0]==0xf5 && buf[1]==0x8b)
		{
			int lenout;
			char *tmp=send_out(source&0x0F,buf[2],&lenout);
			if(tmp!=NULL)
			{
				int ii=0;
				for(ii=0;ii<lenout;ii++)
					rt_kprintf("%2x ",tmp[ii]);
				if(buf[2]==0x0c || buf[2]==0x0d || buf[2]==0x0e || buf[2]==0x0f || buf[2]==0x20)
					_epi_write(source&0x0f,(void *)tmp, lenout,SIGNAL_CONFIG_WITH_IPV6|(SIGNAL_CONFIG_SOCKET0+source&0x0f));
				else
					_epi_write(source&0x0f,(void *)tmp, lenout,ACK_SIGNAL|(SIGNAL_CONFIG_SOCKET0+source&0x0f));
			}
			else
			{
				rt_kprintf("some error\r\n");
				_epi_write(source&0x0f,(void *)COMMAND_FAIL, strlen(COMMAND_FAIL),ACK_SIGNAL|(SIGNAL_CONFIG_SOCKET0+source&0x0f));
			}
		}
		else
			_epi_write(source&0x0f,(void *)COMMAND_FAIL, strlen(COMMAND_FAIL),ACK_SIGNAL|(SIGNAL_CONFIG_SOCKET0+source&0x0f));
		if(buf)
			rt_free(buf);
	}
	else
	{
		if(phy_link&&g_socket[source&0x0f-0x04].connected)
		{
			rt_data_queue_push(&g_data_queue[(source&0x0f -0x04)*2],buf, index_len, RT_WAITING_FOREVER);	
		}
		else
			rt_free(buf);
		_epi_write(source&0x0f-0x04,RT_NULL, 0,ACK_SIGNAL|(SIGNAL_DATA_SOCKET0+source&0x0f-0x04));
	}	
	#endif
}

